ultrasonic59/snail_w/stm32_snail/usb_can_dima/src/my_grbl/my_stepper.c
/*
  stepper.c - stepper motor driver: executes motion plans using stepper motors
  Part of Grbl

  Copyright (c) 2011-2016 Sungeun K. Jeon for Gnea Research LLC
  Copyright (c) 2009-2011 Simen Svale Skogsrud

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

#include "my_grbl.h"

#include "stm32f2xx_rcc.h"
#include "stm32f2xx_tim.h"
#include "misc.h"
#include "my_stepper.h"
#include "printk.h"

void TIM_Configuration(TIM_TypeDef* TIMER, u16 Period, u16 Prescaler, u8 PP);
extern void  put_steps(uint8_t steps);

// Used to avoid ISR nesting of the "Stepper Driver Interrupt". Should never occur though.
static volatile uint8_t busy;
uint8_t curr_dir=0;

static st_block_t st_block_buffer[SEGMENT_BUFFER_SIZE-1];
static segment_t segment_buffer[SEGMENT_BUFFER_SIZE];
static stepper_t st;
// Step segment ring buffer indices
static volatile uint8_t segment_buffer_tail;
static uint8_t segment_buffer_head;
static uint8_t segment_next_head;
static uint16_t step_port_invert_mask;
static uint16_t dir_port_invert_mask;
static plan_block_t *pl_block;     // Pointer to the planner block being prepped
static st_block_t *st_prep_block;  // Pointer to the stepper block data being prepped
static st_prep_t prep;


////===============================================
void  set_curr_dir(uint8_t dirs)
{
curr_dir=dirs;  
}

////===============================================

#if 1
// Step and direction port invert masks.
static PORTPINDEF step_port_invert_mask;
static PORTPINDEF dir_port_invert_mask;

/// This interrupt is enabled by ISR_TIMER1_COMPAREA when it sets the motor port bits to execute
// a step. This ISR resets the motor port after a short period (settings.pulse_microseconds)
// completing one step cycle.
void TIM3_IRQHandler(void)
{
	if ((TIM3->SR & 0x0001) != 0)                  // check interrupt source
	{
		TIM3->SR &= ~(1<<0);                          // clear UIF flag
		TIM3->CNT = 0;
 		NVIC_DisableIRQ(TIM3_IRQn);
    // Reset stepping pins (leave the direction pins)
////		GPIO_Write(STEP_PORT, (GPIO_ReadOutputData(STEP_PORT) & ~STEP_MASK) | (step_port_invert_mask & STEP_MASK));
        put_steps(0) ;
	}
}


////================================================================================



#endif

////===================================================================

/*    BLOCK VELOCITY PROFILE DEFINITION
          __________________________
         /|                        |\     _________________         ^
        / |                        | \   /|               |\        |
       /  |                        |  \ / |               | \       s
      /   |                        |   |  |               |  \      p
     /    |                        |   |  |               |   \     e
    +-----+------------------------+---+--+---------------+----+    e
    |               BLOCK 1            ^      BLOCK 2          |    d
                                       |
                  time ----->      EXAMPLE: Block 2 entry speed is at max junction velocity

  The planner block buffer is planned assuming constant acceleration velocity profiles and are
  continuously joined at block junctions as shown above. However, the planner only actively computes
  the block entry speeds for an optimal velocity plan, but does not compute the block internal
  velocity profiles. These velocity profiles are computed ad-hoc as they are executed by the
  stepper algorithm and consists of only 7 possible types of profiles: cruise-only, cruise-
  deceleration, acceleration-cruise, acceleration-only, deceleration-only, full-trapezoid, and
  triangle(no cruise).

                                        maximum_speed (< nominal_speed) ->  +
                    +--------+ <- maximum_speed (= nominal_speed)          /|\
                   /          \                                           / | \
 current_speed -> +            \                                         /  |  + <- exit_speed
                  |             + <- exit_speed                         /   |  |
                  +-------------+                     current_speed -> +----+--+
                   time -->  ^  ^                                           ^  ^
                             |  |                                           |  |
                decelerate_after(in mm)                             decelerate_after(in mm)
                    ^           ^                                           ^  ^
                    |           |                                           |  |
                accelerate_until(in mm)                             accelerate_until(in mm)

  The step segment buffer computes the executing block velocity profile and tracks the critical
  parameters for the stepper algorithm to accurately trace the profile. These critical parameters
  are shown and defined in the above illustration.
*/
void tst_print(void)
{
  ////==============================================
  printk("\n\r [out=%x,idx=%x][n_step=%x,idx=%x]cycl=[%x][steps0=%x][steps1=%x][steps2=%x][ev_cnt=%x]"
         ,st.step_outbits
         ,st.exec_segment->n_step,st.exec_segment->st_block_index,st.exec_segment->cycles_per_tick
         ,st_block_buffer[st.exec_segment->st_block_index].steps[0]
         ,st_block_buffer[st.exec_segment->st_block_index].steps[1]
         ,st_block_buffer[st.exec_segment->st_block_index].steps[2]
           ,st_block_buffer[st.exec_segment->st_block_index].step_event_count  );
  ////==============================================
}


// Stepper state initialization. Cycle should only start if the st.cycle_start flag is
// enabled. Startup init and limits call this function but shouldn't start the cycle.
void st_wake_up(void)
{
uint8_t rdy_blk=1;  
  // Enable stepper drivers.
  if (bit_istrue(settings.flags,BITFLAG_INVERT_ST_ENABLE)) 
  { 
  SetStepperDisableBit();
  }
  else 
  { 
  ResetStepperDisableBit(); 
  }
  // Initialize stepper output bits to ensure first ISR call does not step.
  st.step_outbits = step_port_invert_mask;

  // Initialize step pulse timing from settings. Here to ensure updating after re-writing.
  #ifdef STEP_PULSE_DELAY
    // Set total step pulse time after direction pin set. Ad hoc computation from oscilloscope.
    st.step_pulse_time = -(((settings.pulse_microseconds+STEP_PULSE_DELAY-2)*TICKS_PER_MICROSECOND) >> 3);
    // Set delay between direction pin write and step command.
    OCR0A = -(((settings.pulse_microseconds)*TICKS_PER_MICROSECOND) >> 3);
  #else // Normal operation
    // Set step pulse time. Ad hoc computation from oscilloscope. Uses two's complement.
    st.step_pulse_time = (settings.pulse_microseconds)*TICKS_PER_MICROSECOND;
  #endif
#if 1
  // Enable Stepper Driver Interrupt
  TIM3->ARR = st.step_pulse_time - 1;
  TIM3->EGR = TIM_PSCReloadMode_Immediate;
  TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
#endif
  TIM2->ARR = st.exec_segment->cycles_per_tick - 1;
  /* Set the Autoreload value */
#ifndef ADAPTIVE_MULTI_AXIS_STEP_SMOOTHING        
  TIM2->PSC = st.exec_segment->prescaler;
#endif
  TIM2->EGR = TIM_PSCReloadMode_Immediate;
  NVIC_EnableIRQ(TIM2_IRQn);
 rdy_blk=1; 
  ////=========================================================         
          tst_print();
 ////=========================================================         
  
